if (!("a" in window)) {
    var a = 1;
}
alert(a);
//Результатом будет undefined т.к.буква а присутствует в документе html, в условии переменной а никого значения не будет присвоено.



var b = function a(x) {
    x && a(--x);
};
alert(a);
//Результата вывода не будет т.к.переменная а не была объявлена, при вызове переменной б можно будет увидеть содержание функции.



function a(x) {
    return x * 2;
}
var a;
alert(a);
//Результатом вывода будет сама функция, сначала мы объявили переменную, с одноименной функцией.если мы будем вызывать переменную без скобок, то будет выведено само содержание функции.



function b(x, y, a) {
    arguments[2] = 10;
    alert(a);
}
b(1, 2, 3);
//Результатом алерта будет присвоенное значение 10.



function a() {
    alert(this);
}
a.call(null);
//Наверное результатом мог бы быть null, если бы функция а принимала значения на вход, но иначе вызов функции будет происходить из window